app/views/posts/index.html.erb

SELECT  1 AS one FROM "comments" WHERE "comments"."post_id" = $1 LIMIT 1  [["post_id", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = $1  [["post_id", 1]]
---

    <% if post.comments.any? %>

SELECT COUNT(*) FROM "likes" WHERE "likes"."comment_id" = $1  [["comment_id", 1]]
---
        <% post.comments.each do |comment| %>
          <p><%= pluralize comment.likes.count, 'like' %></p>