app/controllers/comments_controller.rb

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT 1  [["id", 1]]
---
  def new
    @post = Post.find(params[:post_id])

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT 1  [["id", 1]]
INSERT INTO "comments" ("comment", "thumbsup", "post_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["comment", "nsnsns"], ["thumbsup", 1], ["post_id", 1], ["created_at", "2015-02-22 15:56:20.087241"], ["updated_at", "2015-02-22 15:56:20.087241"]]
---
  def create
    @post = Post.find(params[:post_id])
    @post.comments.create(comment_params)