app/controllers/likes_controller.rb

SELECT  "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT 1  [["id", 1]]
INSERT INTO "likes" ("comment_id", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["comment_id", 1], ["created_at", "2015-02-23 09:34:56.641291"], ["updated_at", "2015-02-23 09:34:56.641291"]]
SELECT COUNT(*) FROM "likes" WHERE "likes"."comment_id" = $1  [["comment_id", 1]]
---
  def create
    @comment = Comment.find(params[:comment_id])
    @comment.likes.create
    render json: {new_like_count: @comment.likes.count}