app/controllers/posts_controller.rb

INSERT INTO "posts" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "post"], ["created_at", "2015-02-21 12:44:26.146619"], ["updated_at", "2015-02-21 12:44:26.146619"]]
---
  def create
    @post = Post.create(post_params)

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT 1  [["id", 1]]
UPDATE "posts" SET "name" = $1, "updated_at" = $2 WHERE "posts"."id" = $3  [["name", "#Playing"], ["updated_at", "2015-02-21 15:02:46.720674"], ["id", 77]]
---
  def update
    @post = Post.find(params[:id])
    @post.update(post_params)